nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB7/KW47B42ZB7_cm33_core0.xml
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE7</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC2_DOM0_MEM0_BLK_CFG_W3</name>
          <description>MBC Memory Block Configuration Word</description>
          <addressOffset>0x304C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBACSEL0</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE0</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL1</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE1</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL2</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE2</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL3</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE3</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL4</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE4</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL5</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE5</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL6</name>
