nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB7/KW47B42ZB7_cm33_core0.xml
        <register>
          <name>EDFR</name>
          <description>EFT Detect Flag</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDF0</name>
              <description>EFT Detect Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF1</name>
              <description>EFT Detect Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF2</name>
              <description>EFT Detect Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF3</name>
              <description>EFT Detect Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF4</name>
              <description>EFT Detect Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF5</name>
              <description>EFT Detect Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF6</name>
              <description>EFT Detect Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF7</name>
              <description>EFT Detect Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF8</name>
              <description>EFT Detect Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF9</name>
              <description>EFT Detect Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF10</name>
              <description>EFT Detect Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF11</name>
              <description>EFT Detect Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF12</name>
              <description>EFT Detect Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF13</name>
              <description>EFT Detect Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF14</name>
              <description>EFT Detect Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF15</name>
              <description>EFT Detect Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF16</name>
              <description>EFT Detect Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF17</name>
              <description>EFT Detect Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF18</name>
              <description>EFT Detect Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDF19</name>
              <description>EFT Detect Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>edie0</name>
                  <description>No EFT event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edie1</name>
                  <description>High or/and low EFT event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
