nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB7/KW47B42ZB7_cm33_core0.xml
        <register>
          <name>R_CNT_LOOP_CTRL</name>
          <description>BIST Loop Count Control Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOOPCNT</name>
              <description>Loop Count Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPOPT</name>
              <description>Loop Option</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz284</name>
                  <description>Loop is disabled; selected BIST operation is run once</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz285</name>
                  <description>Loop is enabled; XADR increments by 1 XADR increments by 1 for each new loop. Stops when total loop count meets LOOPCNT+1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz286</name>
                  <description>Loop is enabled; YADR increments by 1 YADR increments by 1 for each new loop. Stops when total loop count meets LOOPCNT+1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz287</name>
                  <description>Loop is enabled; XADR increments by 2 XADR increments by 2 for each new loop. Stops when total loop count meets LOOPCNT+1.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz288</name>
                  <description>Loop is enabled; XADR increments by sector XADR increments by 16 for each new loop. Stops when total loop count meets LOOPCNT+1.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPUNIT</name>
              <description>Loop Time Unit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz276</name>
                  <description>Clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz277</name>
                  <description>0.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz278</name>
                  <description>1 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz279</name>
                  <description>10 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz280</name>
                  <description>100 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz281</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz282</name>
                  <description>10 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz283</name>
                  <description>100 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPDLY</name>
              <description>Loop Time Delay Scalar</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_TIMER_CTRL</name>
          <description>BIST Timer Control Register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9A449542</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TNVSUNIT</name>
              <description>Tnvs Time Unit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz321</name>
                  <description>Clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz322</name>
                  <description>0.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz323</name>
                  <description>1 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz324</name>
                  <description>10 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz325</name>
                  <description>100 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz326</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz327</name>
                  <description>10 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz328</name>
                  <description>100 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNVSDLY</name>
              <description>Tnvs Time Delay Scalar</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TNVHUNIT</name>
              <description>Tnvh Time Unit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz313</name>
                  <description>Clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz314</name>
                  <description>0.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz315</name>
                  <description>1 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz316</name>
                  <description>10 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz317</name>
                  <description>100 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz318</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz319</name>
                  <description>10 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz320</name>
                  <description>100 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNVHDLY</name>
              <description>Tnvh Time Delay Scalar</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPGSUNIT</name>
              <description>Tpgs Time Unit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz305</name>
                  <description>Clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz306</name>
                  <description>0.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz307</name>
                  <description>1 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz308</name>
                  <description>10 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz309</name>
                  <description>100 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz310</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz311</name>
                  <description>10 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz312</name>
                  <description>100 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPGSDLY</name>
              <description>Tpgs Time Delay Scalar</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCVUNIT</name>
              <description>Trcv Time Unit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz297</name>
                  <description>Clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz298</name>
                  <description>0.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz299</name>
                  <description>1 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz300</name>
                  <description>10 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz301</name>
                  <description>100 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz302</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz303</name>
                  <description>10 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz304</name>
                  <description>100 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCVDLY</name>
              <description>Trcv Time Delay Scalar</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLVSUNIT</name>
              <description>Tlvs Time Unit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz289</name>
                  <description>Clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz290</name>
                  <description>0.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz291</name>
                  <description>1 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz292</name>
                  <description>10 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz293</name>
                  <description>100 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz294</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz295</name>
                  <description>10 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz296</name>
                  <description>100 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TLVSDLY_L</name>
              <description>Tlvs Time Delay Scalar Low</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_TEST_CTRL</name>
          <description>BIST Test Control Register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BIST Busy Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz333</name>
                  <description>BIST is idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz334</name>
                  <description>BIST is busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG</name>
              <description>BIST Debug Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS0</name>
              <description>BIST Status 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz331</name>
                  <description>BIST test passed on flash block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz332</name>
                  <description>BIST test failed on flash block 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS1</name>
              <description>BIST status 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz329</name>
                  <description>BIST test passed on flash block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz330</name>
                  <description>BIST test failed on flash block 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUGRUN</name>
              <description>BIST Continue Debug Run</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STARTRUN</name>
              <description>Run New BIST Operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDINDEX</name>
              <description>BIST Command Index (code)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_IP1</name>
              <description>BIST Disable IP1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_ABORT_LOOP</name>
          <description>BIST Abort Loop Register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ABORT_LOOP</name>
              <description>Abort Loop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz335</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz336</name>
                  <description>Abort BIST loop commands and force the loop counter to return to 0x0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>R_ADR_QUERY</name>
          <description>BIST Address Query Register</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>YADRFAIL</name>
              <description>Failing YADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XADRFAIL</name>
              <description>Failing XADR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DOUT_QUERY0</name>
          <description>BIST DOUT Query 0 Register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOUTFAIL</name>
              <description>Failing DOUT Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SMW_QUERY</name>
          <description>BIST SMW Query Register</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMWLOOP</name>
              <description>SMW Total Loop Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMWLAST</name>
              <description>SMW Last Voltage Setting</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SMW_SETTING0</name>
          <description>BIST SMW Setting 0 Register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0B4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMWPARM0</name>
              <description>SMW Parameter Set 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
