nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB7/KW47B42ZB7_cm33_core0.xml
        <register>
          <name>AGC_IDX4_GAIN_CFG</name>
          <description>AGC IDX4 Gain Config</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_4</name>
              <description>CBPF_GAIN_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_4_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_4_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_4</name>
              <description>LNA_RTRIM_4</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_4</name>
              <description>LNA_ATTN_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_4</name>
              <description>LNA_HATTN_4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_4</name>
              <description>LNA_LGAIN_4</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_4</name>
              <description>LNA_HGAIN_4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_4</name>
              <description>ANT_EN_RLOAD_4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_4_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 4 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_4_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 4 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX3_GAIN_CFG</name>
          <description>AGC IDX3 Gain Config</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x127</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_3</name>
              <description>CBPF_GAIN_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_3_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_3_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_3</name>
              <description>LNA_RTRIM_3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_3</name>
              <description>LNA_ATTN_3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_3</name>
              <description>LNA_HATTN_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_3</name>
              <description>LNA_LGAIN_3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_3</name>
              <description>LNA_HGAIN_3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_3</name>
              <description>ANT_EN_RLOAD_3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_3_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 3 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_3_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 3 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX2_GAIN_CFG</name>
          <description>AGC IDX2 Gain Config</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_2</name>
              <description>CBPF_GAIN_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_2_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_2_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_2</name>
              <description>LNA_RTRIM_2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_2</name>
              <description>LNA_ATTN_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_2</name>
              <description>LNA_HATTN_2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_2</name>
              <description>LNA_LGAIN_2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_2</name>
              <description>LNA_HGAIN_2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_2</name>
              <description>ANT_EN_RLOAD_2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_2_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 2 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_2_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 2 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX1_GAIN_CFG</name>
          <description>AGC IDX1 Gain Config</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB6</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_1</name>
              <description>CBPF_GAIN_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_1_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_1_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_1</name>
              <description>LNA_RTRIM_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_1</name>
              <description>LNA_ATTN_1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_1</name>
              <description>LNA_HATTN_1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_1</name>
              <description>LNA_LGAIN_1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_1</name>
              <description>LNA_HGAIN_1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_1</name>
              <description>ANT_EN_RLOAD_1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_1_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 1 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_1_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 1 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX0_GAIN_CFG</name>
          <description>AGC IDX0 Gain Config</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80F6</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CBPF_GAIN_0</name>
              <description>CBPF_GAIN_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPF_GAIN_0_0</name>
                  <description>-6 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPF_GAIN_0_1</name>
                  <description>0 dB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNA_RTRIM_0</name>
              <description>LNA_RTRIM_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_ATTN_0</name>
              <description>LNA_ATTN_0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_0</name>
              <description>LNA_HATTN_0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_LGAIN_0</name>
              <description>LNA_LGAIN_0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HGAIN_0</name>
              <description>LNA_HGAIN_0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT_EN_RLOAD_0</name>
              <description>ANT_EN_RLOAD_0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_0_DRS_OFS</name>
              <description>Magnitude threshold high offset for AGC gain index 0 when datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_0_DRS_OFS</name>
              <description>Magnitude threshold offset for AGC gain index 0 when datarate_config_sel = 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_MIS_GAIN_CFG</name>
          <description>AGC Miscellaneous Gain Config</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x43</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_RTRIM_IN_DCOC_CAL</name>
              <description>LNA RTFE matching resistor adjustment value during DCOC calibration phase.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_RTRIM_IN_TX_MODE</name>
              <description>LNA RTFE matching resistor adjustment value in TX mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_HATTN_IN_TX_MODE</name>
              <description>LNA high gain capacitor attenuation value in TX mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX11_GAIN_VAL</name>
          <description>AGC IDX11 Gain Value</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_11</name>
              <description>LOG_GAIN_11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_11</name>
              <description>Magnitude threshold high for AGC gain index 11</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_11</name>
              <description>Magnitude threshold for AGC gain index 11</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX10_GAIN_VAL</name>
          <description>AGC_IDX10_GAIN_VAL</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xEB</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_10</name>
              <description>LOG_GAIN_10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_10</name>
              <description>Magnitude threshold high for AGC gain index 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_10</name>
              <description>Magnitude threshold for AGC gain index 10</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX9_GAIN_VAL</name>
          <description>AGC_IDX9_GAIN_VAL</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCD</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_9</name>
              <description>LOG_GAIN_9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_9</name>
              <description>Magnitude threshold high for AGC gain index 9</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_9</name>
              <description>Magnitude threshold for AGC gain index 9</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX8_GAIN_VAL</name>
          <description>AGC_IDX8_GAIN_VAL</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_8</name>
              <description>LOG_GAIN_8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_8</name>
              <description>Magnitude threshold high for AGC gain index 8</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_8</name>
              <description>Magnitude threshold for AGC gain index 8</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX7_GAIN_VAL</name>
          <description>AGC_IDX7_GAIN_VAL</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x96</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_7</name>
              <description>LOG_GAIN_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_7</name>
              <description>Magnitude threshold high for AGC gain index 7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_7</name>
              <description>Magnitude threshold for AGC gain index 7</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
